#ifndef ZAPUSO_H
#define ZAPUSO_H
#define ES_OBO 1 //вариант с обогревом (COM1:АСК,БСОД) // модуль d.pas

#include <QObject>
// объявление УСО

//typedef struct  {
//     char r[16];    //  разъем
//     char n[12];    //  № выхода
//     char o[16];    //  обозначение
//     char i[44];    //  имя
//}  TUsoDiskr;           // z_d; обозначение у Набатчикова

typedef struct  {
     QString  r;    //  разъем
     QString  n;    //  № выхода
     QString  o;    //  обозначение
     QString  i;    //  имя
}  TUsoDiskr;           // z_d; обозначение у Набатчикова

const TUsoDiskr zapDiskr[] =    // zDs:array[0..149]of z_d
{
//        // дискретные БЭЛ                              ------------i-ок-ок--
{"XP1:33  ","кл.1  ","ВТ1     ","УОИ: ВТ1              "}, //000 00 97
{"XP1:35  ","кл.2  ","ВТ2     ","УОИ: ВТ2              "}, //, //001
{"XP1:22  ","кл.3  ","ВТ3     ","УОИ: ВТ3              "}, //002
{"XP1:38  ","кл.4  ","ЭТ      ","УОИ: ЭТ               "}, //003
{"XP1:24  ","кл.5  ","КВ{т}   ","КВ-тяга               "}, //004
{"XP1:37  ","кл.6  ","ВТ4     ","УОИ: ВТ4              "}, //005
{"XP1:36  ","кл.7  ","р{в}    ","реверсор вперед       "}, //006
{"XP1:23  ","кл.8  ","р{н}    ","реверсор назад        "}, //007
{"XP1:20  ","кл.9  ","КВ{эт}  ","КВ-тормоз             "}, //008
{"XP1:21  ","кл.10 ","РУ1     ","пуск дизеля           "}, //009
{"XP1:42  ","кл.11 ","        ","2ПКМ                  "}, //010
{"XP1:4   ","кл.12 ","        ","пуск дизеля           "}, //011
{"XP1:28  ","кл.13 ","        ","                      "}, //012 --
{"XP1:19  ","кл.14 ","        ","                      "}, //013
{"XP1:31  ","кл.15 ","        ","                      "}, //014
{"XP1:8   ","кл.16 ","        ","                      "}, //015
{"XP1:17  ","кл.17 ","        ","                      "}, //016
{"XP1:15  ","кл.18 ","        ","                      "}, //017
{"        ","      ","        ","                      "}, //018
{"        ","      ","        ","                      "}, //019
{"        ","      ","        ","                      "}, //020
{"        ","      ","        ","                      "}, //021
{"        ","      ","        ","                      "}, //022
{"        ","      ","        ","                      "}, //023
{"XP1:C8  ","01    ","D0-1    ","задатчик 1 - код 0    "}, //024 00 98
{"XP1:C7  ","02    ","D1-1    ","задатчик 1 - код 1    "}, //025
{"XP1:C6  ","03    ","D2-1    ","задатчик 1 - код 2    "}, //026
{"XP1:C5  ","04    ","D3-1    ","задатчик 1 - код 3    "}, //027
{"XP1:C4  ","05    ","        ","задатчик 1 - вперед   "}, //028
{"XP1:C3  ","06    ","        ","задатчик 1 - назад    "}, //029
{"XP1:C2  ","07    ","ТТ1     ","задатчик 1 - тяг/торм "}, //030
{"XP1:C1  ","08    ","РВ      ","реверсор вперед       "}, //031
{"XP1:C13 ","09    ","РН      ","реверсор назад        "}, //032
{"XP1:C12 ","10    ","ММ1     ","место машиниста 1     "}, //033
{"XP1:C14 ","11    ","ММ2     ","место машиниста 2     "}, //034
{"XP1:C16 ","12    ","        ","                      "}, //035
{"XP1:C17 ","13    ","D0-2    ","задатчик 2 - код 0    "}, //036 --
{"XP1:C19 ","14    ","D1-2    ","задатчик 2 - код 1    "}, //037
{"XP1:C20 ","15    ","D2-2    ","задатчик 2 - код 2    "}, //038
{"XP1:C21 ","16    ","D3-2    ","задатчик 2 - код 3    "}, //039
{"XP1:C23 ","17    ","        ","задатчик 2 - вперед   "}, //040
{"XP1:C25 ","18    ","        ","задатчик 2 - назад    "}, //041
{"XP1:C26 ","19    ","ТТ2     ","задатчик 2 - тяг/торм "}, //042
{"XP1:C27 ","20    ","        ","тмб.Автопрогрев       "}, //043
{"XP1:C29 ","21    ","        ","Автопрогрев включен   "}, //044
{"XP1:C32 ","22    ","        ","Автопрогрев-4 позиция "}, //045
{"XP1:C31 ","23    ","        ","                      "}, //046
{"XP1:C30 ","24    ","        ","                      "}, //047
//-----------------------------дискретные выходы УСТА----//--i-ок-ок--
{"XS2:C1  ","5013  ","ВШ1     ","ослабление поля 1     "}, //048 00 77
{"XS2:C2  ","5012  ","ВШ2     ","ослабление поля 2     "}, //049
{"XS2:C3  ","5138  ","ВЗТ     ","                      "}, //050
{"XS2:C4  ","5140  ","РЭТ     ","р.экстр.тормоза       "}, //051
{"XS2:C5  ","5160  ","РСИ     ","р.сопротивления изол. "}, //052
{"XS2:C6  ","5021  ","        ","боксование            "}, //053
{"XS2:C7  ","5080  ","        ","перегрев воды         "}, //054
{"XS2:B1  ","5081  ","        ","перегрев масла        "}, //055
{"        ","      ","        ","                      "}, //056
{"        ","      ","        ","                      "}, //057
{"        ","      ","        ","                      "}, //058
{"        ","      ","        ","                      "}, //059
{"        ","      ","        ","                      "}, //060 --
{"        ","      ","        ","                      "}, //061
{"        ","      ","        ","                      "}, //062
{"        ","      ","        ","                      "}, //063
{"        ","      ","        ","                      "}, //064
{"        ","      ","        ","                      "}, //065
{"        ","      ","        ","                      "}, //066
{"        ","      ","        ","                      "}, //067
{"        ","      ","        ","                      "}, //068
{"        ","      ","        ","                      "}, //069
{"        ","      ","        ","                      "}, //070
{"        ","      ","        ","                      "}, //071
//---------------------------------------дискретные входы УСТА-----//--i-ок-ок--
{"XP1:A1  ","5006  ","РУ2     ","2 ПКМ                 "}, //072  0 78
{"XP1:A2  ","5017  ","ВТ1     ","                      "}, //073
{"XP1:A3  ","5018  ","ВТ2     ","                      "}, //074
{"XP1:A4  ","5019  ","ВТ3     ","                      "}, //075
{"XP1:A5  ","5020  ","ВТ4     ","                      "}, //076
{"XP1:B1  ","5011  ","КВ      ","конт.возбуждения      "}, //077
{"XP1:B2  ","5010  ","1-8 КМ  ","1-8 ПКМ               "}, //078
{"XP1:B3  ","5164  ","РЗ      ","реле земли            "}, //079
{"XP1:B4  ","1166  ","ДРУ     ","уровень воды          "}, //080
{"XP1:B5  ","5014  ","Упр.о.п.","управление переходами "}, //081
{"XP1:C1  ","5035  ","ОМ1     ","отключатель моторов   "}, //082
{"XP1:C2  ","5036  ","ОМ2     ","отключатель моторов   "}, //083
{"XP1:C3  ","5136  ","ЭТ      ","выход БЭЛ ЭДТ         "}, //084 --
{"XP1:C4  ","5115  ","РЭТ     ","РЭТ по сх. КВТ 1,2    "}, //085
{"XP1:C5  ","5150  ","        ","обрыв ТМ {РУ15}       "}, //086
{"XP1:C6  ","5151  ","        ","пуск дизеля {КМ1}     "}, //087
{"        ","      ","        ","                      "}, //088
{"        ","      ","        ","                      "}, //089
{"        ","      ","        ","                      "}, //090
{"        ","      ","        ","                      "}, //091
{"        ","      ","        ","                      "}, //092
{"        ","      ","        ","                      "}, //093
{"        ","      ","        ","                      "}, //094
{"        ","      ","        ","                      "}, //095
//-----------------------------------------------------------------//-----------
{"        ","      ","        ","                      "}, //096
{"        ","      ","        ","                      "}, //097
{"        ","      ","        ","                      "}, //098
{"        ","      ","        ","                      "}, //099
//---------------------------------------дискретные БСОДС----------//--i-ок-ок--
{"        ","      ","        ","состояние САПТ        "}, //100 0  0
{"        ","      ","        ","                      "}, //101 1
{"        ","      ","        ","                      "}, //102 2
{"        ","      ","        ","                      "}, //103 3
{"        ","      ","        ","                      "}, //104 4
{"        ","      ","        ","                      "}, //105 5
{"        ","      ","        ","                      "}, //106 6
{"        ","      ","        ","                      "}, //107 7
{"        ","      ","        ","SA1 Автопрогрев вкл.  "}, //108 0  1
{"        ","      ","        ","КМ установлен в 0     "}, //109 1
{"        ","      ","        ","Дизель запущен        "}, //110 2
{"        ","      ","        ","Т теплоносителей<20°С "}, //111 3
{"        ","      ","        ","Uакб < 57В            "}, //112 4
{"        ","      ","        ","                      "}, //113 5
{"        ","      ","        ","                      "}, //114 6
{"        ","      ","        ","                      "}, //115 7
{"        ","      ","сообщ.  ","Автопрогрев включен   "}, //116 0  2
{"        ","      ","сообщ.  ","Дизель не запустился  "}, //117 1
{"        ","      ","сообщ.  ","Т теплонос.<20°С      "}, //118 2
{"        ","      ","сообщ.  "," Uакб < 57В           "}, //119 3
{"        ","      ","        ","                      "}, //120 4
{"        ","      ","        ","                      "}, //121 5
{"        ","      ","        ","                      "}, //122 6
{"        ","      ","        ","                      "}, //123 7
{"        ","      ","вход 0  ","позиция 0             "}, //124 0  3
{"        ","      ","вход 1  ","Автопрогрев включен   "}, //125 1
{"        ","      ","вход 2  ","Дизель запущен        "}, //126 2
{"        ","      ","        ","                      "}, //127 3
{"        ","      ","        ","                      "}, //128 4
{"        ","      ","        ","                      "}, //129 5
{"        ","      ","        ","                      "}, //130 6
{"        ","      ","        ","                      "}, //131 7
{"        ","      ","вых. 0  ","Пуск дизеля           "}, //132 0  4
{"        ","      ","вых. 1  ","Останов дизеля        "}, //133 1
{"        ","      ","вых. 2  ","Режим индикации       "}, //134 2
{"        ","      ","        ","                      "}, //135 3
{"        ","      ","        ","                      "}, //136 4
{"        ","      ","        ","                      "}, //137 5
{"        ","      ","        ","                      "}, //138 6
{"        ","      ","        ","                      "}, //139 7
{"        ","      ","бит 0   ","U бортовой сети       "}, //140 0  5
{"        ","      ","бит 1   ","                      "}, //141 1
{"        ","      ","бит 2   ","                      "}, //142 2
{"        ","      ","бит 3   ","                      "}, //143 3
{"        ","      ","бит 4   ","                      "}, //144 4
{"        ","      ","бит 5   ","                      "}, //145 5
{"        ","      ","бит 6   ","                      "}, //146 6
{"        ","      ","бит 7   ","                      "}, //147 7
{"        ","      ","        ","                      "}, //148
{"        ","      ","        ","                      "}//149
};

//=======================================//аналоговые================================================

//typedef struct  {
//     char r[24];    //  разъем
//     char n[20];    //  № выхода
//     char o[12];    //  обозначение
//     char i[100];   //  имя
//     char a[12];    //  размерность
//}  TUsoAnalog;                    // z_0; обозначение у Набатчикова

typedef struct  {
     QString r;    //  разъем
     QString n;    //  № выхода
     QString o;    //  обозначение
     QString i;   //  имя
     QString a;    //  размерность
}  TUsoAnalog;

const TUsoAnalog zapAnalog[] =    // zA0:array[0..139]of z_0
{
//     {аналоговые УСТА----}//-------------------------------------------//инд-ок-мсс-ок
{"XS1:A1,A2   ","5028,5027 ","ДН1   ","Напряжение генератора                             ","В     "}, //000 00 000 89
{"XS1:A3,A4   ","5030,5029 ","ДТ1   ","Ток генератора                                    ","А     "}, //001    001
{"XS1:A7,A8   ","5032,5031 ","ДБ2   ","Напряжение буксования второй тележки              ","В     "}, //002    002
{"XS1:A5,A6   ","5034,5033 ","ДБ1   ","Напряжение буксования первой тележки              ","В     "}, //003    003
{"XS1:A9,A0   ","5026,5025 ","ДН2   ","Напряжение цепи управления-корпус                 ","В     "}, //004    004
{"XS1:B1,B2   ","5067,5066 ","ДТ2   ","Ток первой группы ТЭД                             ","А     "}, //005    005
{"XS1:B3,B4   ","5059,5058 ","ДТ3   ","Ток второй группы ТЭД                             ","А     "}, //006    006
{"XS1:B5,B6   ","5040,5039 ","ДНБС  ","Напряжение бортовой сети                          ","В     "}, //007    007
{"XS1:B7,B8   ","5061,5060 ","ДТ4   ","Ток возбуждения ВСТ                               ","А     "}, //008    008
{"            ","          ","ДД4   ","Давление топлива на входе ТНВД                    ","кг/см2"}, //009    009
{"            ","          ","ДД3   ","Давление топлива на входе ФТОТ                    ","кг/см2"}, //010 01 000
{"            ","          ","ДТ5   ","Ток заряда АКБ {фильтр}                           ","А     "}, //011    011
{"XS1:C5,C6   ","3596,3597 ","ДД1   ","Давление масла на входе в дизель                  ","кг/см2"}, //012    012
{"            ","          ","ДД2   ","Давление масла на выходе 2 МН                     ","кг/см2"}, //013    013
{"XS1:C9,C0   ","5168,5167 ","ДТ6   ","Ток возбуждения генератора                        ","А     "}, //014    014
{"            ","          ","      ","Позиция контроллера машиниста                     ","      "}, //015    015
{"            ","          ","ДЧВ   ","Частота вращения вала дизеля                      ","об/м  "}, //016    016
{"            ","          ","      ","Частота сети                                      ","гц    "}, //017    017
{"            ","          ","      ","Напряжение бортовой сети {фильтр}                 ","В     "}, //018    018
{"            ","          ","ШИМ2  ","Угол выпрямителя самовозбуждения                  ","е.г.  "}, //019    019
{"            ","          ","      ","Напряжение генератора {задание}                   ","В     "}, //020 02 020
{"            ","          ","      ","Напряжение генератора {фильтр}                    ","В     "}, //021    021
{"            ","          ","ШИМ1  ","Угол упр. выпрямителем возб.Г                     ","е.г.  "}, //022    022
{"            ","          ","      ","Ток генератора {фильтр}                           ","А     "}, //023    023
{"            ","          ","      ","Ток первой группы ТЭД {фильтр}                    ","А     "}, //024    024
{"            ","          ","      ","Ток второй группы ТЭД {фильтр}                    ","А     "}, //025    025
{"            ","          ","      ","Мощность генератора {задание}                     ","Вт    "}, //026    026
{"            ","          ","      ","Мощность генератора {рассчет}                     ","Вт    "}, //027    027
{"            ","          ","      ","Мощность генератора                               ","Вт    "}, //028    028
{"            ","          ","      ","Режим регулятора напряжения                       ","      "}, //029    029
{"            ","          ","      ","Ток торможения {задание}                          ","А     "}, //030 03 030
{"            ","          ","      ","Ток возбуждения ЭТ {задание}                      ","А     "}, //031    031
{"            ","          ","      ","U боксования первой тележки {фильтр}              ","В     "}, //032    032
{"            ","          ","      ","U боксования второй тележки {фильтр}              ","В     "}, //033    033
{"            ","          ","      ","Флаг боксования                                   ","      "}, //034    034
{"            ","          ","      ","                                                  ","      "}, //035    035
{"            ","          ","      ","                                                  ","      "}, //036    036
{"            ","          ","      ","                                                  ","      "}, //037    037
{"            ","          ","      ","                                                  ","      "}, //038    038
{"            ","          ","      ","                                                  ","      "}, //039    039
//-------------------------------------аналоговые БЭЛ-------------------------------------------------//инд-ок-мсс-ок
{"            ","          ","      ","реверсор вперед                                   ","      "}, //040 00 000 99
{"            ","          ","      ","реверсор назад                                    ","      "}, //041    000
{"            ","          ","      ","режим: тормоз-тяга                                ","      "}, //042    000
{"            ","          ","      ","ошибка включения                                  ","      "}, //043    000
{"            ","          ","      ","начальное включение                               ","      "}, //044    000
{"            ","          ","      ","ошибка места                                      ","      "}, //045    000
{"            ","          ","      ","ошибка тяга-тормоз                                ","      "}, //046    000
{"            ","          ","      ","ошибка вперед-назад                               ","      "}, //047    000
{"            ","          ","      ","позиция контроллера машиниста                     ","      "}, //048
//----------------------------------------------------------------------------------------------------//-------------
{"            ","          ","      ","                                                  ","      "}, //049
//-------------------------------------аналоговые ТИ--------------------------------------------------//-------------
{"XS5:01-04   ","ТСМ1      ","ВК9   ","холодный спай                                     ","°C    "}, //050 00 040 79
{"XS1:07,13   ","ТСМ2      ","ВК12  ","топливо на входе в ТНВД дизеля                    ","°C    "}, //051    041
{"XS1:10,09   ","ТСМ3      ","ВК13  ","масло на входе в дизель                           ","°C    "}, //052    042
{"XS1:15,16   ","ТСМ4      ","ВК14  ","масло на выходе из дизеля                         ","°C    "}, //053    043
{"XS1:19,25   ","ТСМ5      ","      ","                                                  ","°C    "}, //054    044
{"XS1:22,21   ","ТСМ6      ","ВК16  ","вода на выходе из дизеля                          ","°C    "}, //055    045
{"XS1:27,28   ","ТСМ7      ","      ","                                                  ","°C    "}, //056    046
{"XS1:31,32   ","ТСМ8      ","ВК21  ","вода на входе в насос холод.контура 2             ","°C    "}, //057    047
{"XS2:03,04   ","ТСМ9      ","ВК22  ","вода на входе в охладитель масла                  ","°C    "}, //058    048
{"XS2:07,13   ","ТСМ10     ","ВК18  ","вода на входе в дизель                            ","°C    "}, //059    049
 #ifdef ES_OBO
{"XS2:10,09   ","ТСМ11     ","ВК23  ","вода на входе в калорифер                         ","°C    "}, //060 01 050
{"XS2:15,16   ","ТСМ12     ","ВК24  ","вода на выходе из калорифера                      ","°C    "}, //061    051
{"XS2:19,25   ","ТСМ13     ","ВК25  ","воздух окружающий                                 ","°C    "}, //062    052
#else
{"XS2:10,09   ","ТСМ11     ","      ","                                                  ","°C    "}, //060 01 050
{"XS2:15,16   ","ТСМ12     ","      ","                                                  ","°C    "}, //061    051
{"XS2:19,25   ","ТСМ13     ","      ","                                                  ","°C    "}, //062    052
#endif
{"XS2:22,21   ","ТСМ14     ","      ","                                                  ","°C    "}, //063    053
{"XS2:27,28   ","ТСМ15     ","      ","                                                  ","°C    "}, //064    054
{"XS2:31,32   ","ТСМ16     ","      ","                                                  ","°C    "}, //065    055
{"XS3:03,04   ","ТСМ17     ","      ","                                                  ","°C    "}, //066    056
{"XS3:07,13   ","ТСМ18     ","      ","                                                  ","°C    "}, //067    057
{"XS3:10,09   ","ТСМ19     ","      ","                                                  ","°C    "}, //068    058
{"XS3:15,16   ","ТСМ20     ","      ","                                                  ","°C    "}, //069    059
{"XS3:19,25   ","ТСМ21     ","      ","                                                  ","°C    "}, //070 02 060
{"XS3:22,21   ","ТСМ22     ","      ","                                                  ","°C    "}, //071    061
{"XS3:27,28   ","ТСМ23     ","      ","                                                  ","°C    "}, //072    062
{"XS3:31,32   ","ТСМ24     ","      ","                                                  ","°C    "}, //073    063
{"            ","          ","      ","                                                  ","      "}, //074
{"            ","          ","      ","                                                  ","      "}, //075
{"            ","          ","      ","                                                  ","      "}, //076
{"            ","          ","      ","                                                  ","      "}, //077
{"            ","          ","      ","                                                  ","      "}, //078
{"            ","          ","      ","                                                  ","      "}, //079
{"XS5:07      ","ТХА1      ","      ","                                                  ","°C    "}, //080 00 049
{"XS5:08      ","ТХА2      ","ВК8   ","вход в ТК                                         ","°C    "}, //081    051
{"XS5:09      ","ТХА3      ","      ","                                                  ","°C    "}, //082    053
{"XS5:10      ","ТХА4      ","      ","                                                  ","°C    "}, //083    055
{"XS5:11      ","ТХА5      ","      ","                                                  ","°C    "}, //084    057
{"XS5:12      ","ТХА6      ","      ","                                                  ","°C    "}, //085    059
{"XS5:13      ","ТХА7      ","      ","                                                  ","°C    "}, //086    061
{"XS5:14      ","ТХА8      ","ВК6   ","06 цилиндр                                        ","°C    "}, //087    063
{"XS5:15      ","ТХА9      ","      ","                                                  ","°C    "}, //088    065
{"XS5:16      ","ТХА10     ","ВК5   ","05 цилиндр                                        ","°C    "}, //089    067
{"XS5:17      ","ТХА11     ","ВК7   ","вход в ТК                                         ","°C    "}, //090 01 069
{"XS5:18      ","ТХА12     ","ВК4   ","04 цилиндр                                        ","°C    "}, //091    071
{"XS5:19      ","ТХА13     ","      ","                                                  ","°C    "}, //092    073
{"XS5:20      ","ТХА14     ","      ","                                                  ","°C    "}, //093    075
{"XS5:21      ","ТХА15     ","      ","                                                  ","°C    "}, //094    077
{"XS5:22      ","ТХА16     ","      ","                                                  ","°C    "}, //095    079
{"XS5:23      ","ТХА17     ","      ","                                                  ","°C    "}, //096    081
{"XS5:24      ","ТХА18     ","      ","                                                  ","°C    "}, //097    083
{"XS5:25      ","ТХА19     ","ВК1   ","01 цилиндр                                        ","°C    "}, //098    085
{"XS5:26      ","ТХА20     ","      ","                                                  ","°C    "}, //099    087
{"XS5:27      ","ТХА21     ","ВК2   ","02 цилиндр                                        ","°C    "}, //100 02 089
{"XS5:28      ","ТХА22     ","      ","                                                  ","°C    "}, //101    091
{"XS5:29      ","ТХА23     ","ВК3   ","03 цилиндр                                        ","°C    "}, //102    093
{"XS5:30      ","ТХА24     ","      ","                                                  ","°C    "}, //103    095
{"            ","          ","      ","                                                  ","      "}, //104
{"            ","          ","      ","                                                  ","      "}, //105
{"            ","          ","      ","                                                  ","      "}, //106
{"            ","          ","      ","                                                  ","      "}, //107
{"            ","          ","      ","                                                  ","      "}, //108
{"            ","          ","      ","                                                  ","      "}, //109
//---------------------------------------------аналоговые АСК-----------------------------------------//----------
{"            ","          ","      ","Вес топлива                                       ","кг    "}, //110 00 000
{"            ","          ","      ","Температура топлива                               ","°C    "}, //111    001
{"            ","          ","      ","Секунда широты {дробная часть}                    ","      "}, //112    002
{"            ","          ","      ","Секунда долготы {дробная часть}                   ","      "}, //113    003
{"            ","          ","      ","Скорость                                          ","км/час"}, //114    004
{"            ","          ","      ","Положение над уровнем моря                        ","м     "}, //115    005
{"            ","          ","      ","Год                                               ","      "}, //116    006
{"            ","          ","      ","Месяц                                             ","      "}, //117    007
{"            ","          ","      ","День                                              ","      "}, //118    008
{"            ","          ","      ","Час                                               ","      "}, //119    009
{"            ","          ","      ","Минута                                            ","      "}, //120 01 010
{"            ","          ","      ","Секунда                                           ","      "}, //121    011
{"            ","          ","      ","Градус широты                                     ","      "}, //122    012
{"            ","          ","      ","Минута широты                                     ","      "}, //123    013
{"            ","          ","      ","Секунда широты                                    ","      "}, //124    014
{"            ","          ","      ","Градус долготы                                    ","      "}, //125    015
{"            ","          ","      ","Минута долготы                                    ","      "}, //126    016
{"            ","          ","      ","Секунда долготы                                   ","      "}, //127    017
{"            ","          ","      ","Полушарие {N-S-W-E}                               ","      "}, //128    018
{"            ","          ","      ","Статус GPS {-, 2D, 3D}                            ","      "}, //129    019
{"            ","          ","      ","Открыта крышка модуля АСК                         ","      "}, //130 02 020
{"            ","          ","      ","Эхо ТС БСОДС                                      ","      "}, //131    021
{"            ","          ","      ","                                                  ","      "}, //132    022
{"            ","          ","      ","                                                  ","      "}, //133    023
{"            ","          ","      ","                                                  ","      "}, //134    024
{"            ","          ","      ","                                                  ","      "}, //135    025
{"            ","          ","      ","                                                  ","      "}, //136    026
{"            ","          ","      ","                                                  ","      "}, //137    027
{"            ","          ","      ","                                                  ","      "}, //138    028
{"            ","          ","      ","                                                  ","      "}//139    029
};
#endif // ZAPUSO_H
